algos-b-tree.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-29 Tue 00:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>B Tree</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">B Tree</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6f31a1c">1. 概述</a></li>
<li><a href="#org9a01495">2. 应用</a></li>
<li><a href="#org1066f9f">3. 分析</a>
<ul>
<li><a href="#orgd5c2e58">3.1. 定义</a></li>
<li><a href="#orgb176521">3.2. 运行时间上限</a></li>
<li><a href="#org6bc4505">3.3. 改进与变形</a></li>
</ul>
</li>
<li><a href="#org0d3fd0f">4. B树实现</a></li>
<li><a href="#org3cb4b25">5. 外部链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6f31a1c" class="outline-2">
<h2 id="org6f31a1c"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
相比于内存, 访问磁盘/磁带等块设备时, 大块数据读写有更好的性能. 为高效使用这类设备, 应组织数据结构, 将多份数据放入一个块中. B树是解决此问题的算法统称, 具体实现时, 会基于应用场景进行优化, <a href="algos-bplustree.html">B+ Tree</a>(<a href="https://en.wikipedia.org/wiki/B%2B_tree">WIKI</a>)和<a href="algos-bstar-tree.html">\(B^*\) Tree</a>(<a href="https://en.wikipedia.org/wiki/B*">WIKI</a>)是典型代表.
</p>

<p>
关于磁盘性能特征, 请访问<a href="storage-disk-test-data.html">磁盘测试数据</a>.
</p>
</div>
</div>

<div id="outline-container-org9a01495" class="outline-2">
<h2 id="org9a01495"><span class="section-number-2">2</span> 应用</h2>
<div class="outline-text-2" id="text-2">
<p>
B树(或其变形)广泛应用于有大量元数据需要保存到外部存储介质的应用场景, 例如文件系统, 数据库, 以及存储自精简/压缩/重删等特性中.
</p>
</div>
</div>

<div id="outline-container-org1066f9f" class="outline-2">
<h2 id="org1066f9f"><span class="section-number-2">3</span> 分析</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgd5c2e58" class="outline-3">
<h3 id="orgd5c2e58"><span class="section-number-3">3.1</span> 定义</h3>
<div class="outline-text-3" id="text-3-1">
<p>
读过资料中, B树最完整清晰定义来自<a href="http://www-cs-faculty.stanford.edu/~uno/taocp.html">TAOCP</a>:
</p>

<blockquote>
<p>
1970年, R.Bayer和E.McCreight发现了一种利用多路树分支进行外部查找的新方法,
马克.考夫曼也几乎在同一时间独立地发现了这一方法(未发表). 他们的思想基于一种被称为B树的通用新型数据结构, 有可能利用相对简单的算法来查找和更新大型数据文件,
并能在最差情况下保证效率.
</p>

<p>
\(m\)阶B树是满足以下性质的树:
</p>
<ol class="org-ol">
<li>每个节点最多有\(m\)个子节点;</li>
<li>除了根节点及叶子外, 每个节点至少有\(m/2\)个子节点;</li>
<li>根节点至少有\(2\)个子节点(除非它是一个叶子);</li>
<li>所有叶子都出现在同一级别, 并且不携带任何信息;</li>
<li>具有k个子节点的非叶节点包含\(k-1\)个键.</li>
</ol>

<p>
R.Bayer和McCreight仅考虑了\(m\)为奇数的情景, 因此m阶B树实际指\(2m+1\)阶B树.
</p>

<p>
B树插入节点导致分割时, 是由顶部向上生长的, 而不是在底部向下延伸, 这是因为
B树仅在分割根节点时才增高. 这正是此思想的美妙之处.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgb176521" class="outline-3">
<h3 id="orgb176521"><span class="section-number-3">3.2</span> 运行时间上限</h3>
<div class="outline-text-3" id="text-3-2">
<p>
给定\(m\)阶B树, 假定存在\(N\)个键, \(N+1\)个叶子出现在\(l\)级, 则
\(1, 2, 3, \dots{}\)级上的节点数至少为
\(2, \lceil{}m/2\rceil, \lceil{}m/2\rceil^2, \dots{}\) 因此
\[N+1 \ge 2\lceil{}m/2\rceil^{l-1} \]
\[l \le 1+log_{\lceil{}m/2\rceil}(\frac{N+1}{2})\]
在\(N=1999 998, m=199\)时, \(l\)最多为3, 根常驻内存, 因此最多两次读盘.
</p>

<p>
插入一个新的节点时, 可能必须分割多达\(l\)个节点, 但构造整颗树时, 发生的总分割次数就是树中内部节点总数减去\(l\), 所以分割节点的平均数要少很多. 如果有\(p\)个内部节点, 则至少有\(1+(\lceil{}m/2\rceil{}-1)(p-1)\)个键. 因此
\[p \le 1 + \frac{N-1}{\lceil{}m/2\rceil{}-1}\]
可知, 在构造一个由\(N\)个键组成的树时, 每做一次插入, 需要分割节点的平均次数少于\(\frac{1}{\lceil{}m/2\rceil-1}\).
</p>
</div>
</div>

<div id="outline-container-org6bc4505" class="outline-3">
<h3 id="org6bc4505"><span class="section-number-3">3.3</span> 改进与变形</h3>
<div class="outline-text-3" id="text-3-3">
<p>
参考<a href="algos-bplustree.html">B+ Tree</a>(<a href="https://en.wikipedia.org/wiki/B%2B_tree">WIKI</a>)和<a href="algos-bstar-tree.html">\(B^*\) Tree</a>(<a href="https://en.wikipedia.org/wiki/B*">WIKI</a>).
</p>
</div>
</div>
</div>

<div id="outline-container-org0d3fd0f" class="outline-2">
<h2 id="org0d3fd0f"><span class="section-number-2">4</span> B树实现</h2>
<div class="outline-text-2" id="text-4">
<p>
B树需要实现创建, 插入, 删除, 搜索, 销毁操作. 参考代码&lt;uncompleted&gt;
</p>
</div>
</div>

<div id="outline-container-org3cb4b25" class="outline-2">
<h2 id="org3cb4b25"><span class="section-number-2">5</span> 外部链接</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>B Tree: <a href="https://en.wikipedia.org/wiki/B-tree">https://en.wikipedia.org/wiki/B-tree</a></li>
<li>B+ Tree: <a href="https://en.wikipedia.org/wiki/B%2B_tree">https://en.wikipedia.org/wiki/B+_tree</a></li>
<li>\(B* Tree\): <a href="https://en.wikipedia.org/wiki/B*">https://en.wikipedia.org/wiki/B*</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
